/* --------------------------------------------------------------------- */
/* Code Structure                                                        */
/* --------------------------------------------------------------------- */

// 한 줄 주석 (single line comment)
console.log('ECMAScript의 `문`은 어떠한 작업을 수행하는 문법 구조 및 명령을 의미합니다.');

/*
  여러 줄 (multi lines)
  주석 (comment)
*/

// 세미콜론 (semicolons)
console.log('다음 줄애서 코드를 작성 할 경우, 세미콜론을 붙인 것과 동일합니다.')
console.log('하지만 세미콜론을 명시적으로 추가할 것을 권장합니다.')

console.log('예를 들어 작성된 세미콜론이 없는 코드를 압축할 경우...')
('어떤 일이 발생할까요?');


